In [1]:
import pandas as pd

<h3> Pandas </h3>
<ul>
<li>Series</li>
<li>DataFrame</li>
<li>Panel</li>
</ul>

<h3> Series</h3>

In [6]:
#create empty series
s = pd.Series()

In [7]:
s

Series([], dtype: float64)

In [8]:
import numpy as np

In [9]:
data = np.array(['a','b','c','d'])

In [10]:
s = pd.Series(data)

In [11]:
s

0    a
1    b
2    c
3    d
dtype: object

In [16]:
s = pd.Series(data,index=[100,101,102,103])

In [17]:
s

100    a
101    b
102    c
103    d
dtype: object

In [18]:
#create series from dict
data = {'a':0.,'b':1.,'c':2.}

In [19]:
s = pd.Series(data)

In [20]:
s

a    0.0
b    1.0
c    2.0
dtype: float64

In [21]:
data = {'a':0.,'b':1.,'c':2.}

In [22]:
s = pd.Series(data,index = ['b','c','d','a'])

In [24]:
s #NaN (Not a Number)

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [29]:
#create a series from scalar
s = pd.Series(5,index=[0,1,2,3]) #try : replace 5 by a

In [30]:
s

0    5
1    5
2    5
3    5
dtype: int64

In [31]:
s = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [32]:
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [33]:
s[-3:]

c    3
d    4
e    5
dtype: int64

In [34]:
s['a']

1

In [35]:
s[['b','c','d']]

b    2
c    3
d    4
dtype: int64

In [36]:
s['k']

KeyError: 'k'

<h3>DataFrame</h3>
<br>
we can use following to create DataFrame:
<br>
<ul>
    <li>Lists</li>
    <li>dict</li>
    <li>Series</li>
    <li>Numpy ndarray</li>
    <li>another DataFrame</li>
</ul>

In [40]:
#creating empty dataframe
df = pd.DataFrame()

In [41]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [42]:
#creating dataframe using list
data = [1,2,3,4,5]

In [43]:
df = pd.DataFrame(data)

In [44]:
df

   0
0  1
1  2
2  3
3  4
4  5

In [45]:
data = [['alex',10],['bob',12],['clarke',13]]

In [46]:
df = pd.DataFrame(data,columns=['Name','age'])

In [47]:
df

     Name  age
0    alex   10
1     bob   12
2  clarke   13

In [48]:
data = [['alex',10],['bob',12],['clarke',13]]

In [49]:
df = pd.DataFrame(data,columns=['name','age'],dtype=float)

In [50]:
df

     name   age
0    alex  10.0
1     bob  12.0
2  clarke  13.0

In [51]:
data = {'name':['tom','jack','steve','ricky'],'age':[28,34,29,42]}

In [52]:
df = pd.DataFrame(data)

In [53]:
df

    name  age
0    tom   28
1   jack   34
2  steve   29
3  ricky   42

In [54]:
#create a dataframe from list of dicts
d = [{'a':1,'b':2},{'a':5,'b':10,'c':20}]

In [55]:
pd.DataFrame(d)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [56]:
 d1 ={1,2,3,4,5}

In [57]:
d2 = {'a','b','c','d','e'}

In [58]:
d3 = [d1,d2]

In [59]:
pd.DataFrame(d3)

   0  1  2  3  4
0  1  2  3  4  5
1  b  d  a  e  c

In [60]:
d = [{'a':1,'b':2},{'a':5,'b':10,'c':20}]

In [61]:
df1 = pd.DataFrame(d,index=['first','second'],columns=['a','b'])

In [62]:
df1

        a   b
first   1   2
second  5  10

In [63]:
df2 = pd.DataFrame(d,index=['first','second'],columns=['a','b1'])

In [64]:
df2

        a  b1
first   1 NaN
second  5 NaN

In [65]:
#create  dataframe from dict of series
d = {'one':pd.Series([1,2,3], index=['a','b','c']),
    'two':pd.Series([1,2,3,4], index=['a','b','c','d'])}

In [66]:
df = pd.DataFrame(d)

In [67]:
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [68]:
#column selection
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [69]:
#column addiiton
df['three'] = pd.Series([10,20,30], index = ['a','b','c'])

In [71]:
df

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [74]:
df['four'] = df['one'] + df['three']

In [75]:
df

    one  two  three  four
a  11.0    1   10.0  21.0
b  22.0    2   20.0  42.0
c  33.0    3   30.0  63.0
d   NaN    4    NaN   NaN

In [76]:
#column deletion
del(df['two'])

In [77]:
df

    one  three  four
a  11.0   10.0  21.0
b  22.0   20.0  42.0
c  33.0   30.0  63.0
d   NaN    NaN   NaN

In [78]:
df.loc['c'] #selection by index

one      33.0
three    30.0
four     63.0
Name: c, dtype: float64

In [79]:
df.iloc[2] #seletion by integer location

one      33.0
three    30.0
four     63.0
Name: c, dtype: float64

In [80]:
#slice row
df[2:4]

    one  three  four
c  33.0   30.0  63.0
d   NaN    NaN   NaN